# 깃(Git)을 이용하면 하나의 프로젝트를 여러 사람들과 함께
# 효과적으로 관리하여 협업할 수 있습니다.
# git은 여러 명이 동시에 개발할 수 있게 해준다는 장점이 있다.


# Git은 Linux기반으로 오픈소스 프로젝트로 만들어짐
# 개발자의 현실적인 장점으로는 포토폴리오로 사용할 수 있다.


# SVN과 Git의 차이점
=> SVN은 중앙 서버에서 소스코드를 관리 해주는데 (중앙서버가 망가지면 큰일남) 
   Git은 중앙 서버없이 협업이 가능하다.;

# [ Git의 장점 ]
# 분산적인 개발 : Git을 사용하는 전체 개발 내역을 각 개발자의 로컬 컴퓨터로 복사할 수 있습니다.
#                나중에 서로 수정된 내역을 합치기(Merge)할 수도 있으며 이 때 Git 고유한 프로토콜을 이용하게 됩니다.

# 효율적인 개발 : Git은 일반적인 다른 버전 관리 시스템보다 성능이 뛰어나며, 변경 이력이 많더라도 변경된
#                내용만 처리한다는 점에서 메모리적인 효율성 또한 뛰어 납니다.

# 비선형적인 개발 : Git은 브랜치(Branch)라는 개념이 사용됩니다. 다시 말해서 프로젝트의 가지치기가 가능 합니다.
#                  이는 트리 구조, 다시 말해서 비선형적인 구조라고 볼 수 있습니다.

# 변경 이력 보장 : 작업된 모든 내역(Commit 내역)들은 모두 별도의 영역에서 관리되어 안전하게
#                 프로젝트를 운영할수 있습니다.